CI4_BUKU/app/Controllers/Buku.php

SELECT *
FROM `tb_buku`
---
    public function index (){
        $buku_model = new BukuModel();
        $all_data_buku = $buku_model ->findAll();

INSERT INTO `tb_buku` (`judul`, `penulis`, `penerbit`, `tahun_terbit`) VALUES ('Exhuma', 'tereliye', 'PT. KHistory', '2024')
---
    public function proses_add_buku(){
        $buku_model = new BukuModel();
        $buku_model->insert($this->request->getPost());

SELECT *
FROM `tb_buku`
WHERE `tb_buku`.`id` = '1'
---
    public function edit_data_buku($id=false){
        $buku_model = new BukuModel();
        $data_buku = $buku_model->find($id);

DELETE FROM `tb_buku`
WHERE `id` IN ('5')
---
    public function delete_data_buku ($id = false){
        $buku_model = new BukuModel();
        $buku_model ->delete ($id);